{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 240, 73], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_size": [25], "activity_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "padding": "same", "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "trainable": true, "filters": 256, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "name": "max_pooling1d_1", "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1"}, {"class_name": "UpSampling1D", "config": {"trainable": true, "size": 2, "name": "up_sampling1d_1"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "up_sampling1d_1"}, {"class_name": "Dropout", "config": {"batch_input_shape": [null, 120, 256], "trainable": true, "name": "dropout_2", "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_size": [25], "activity_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_2", "padding": "same", "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "trainable": true, "filters": 73, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv1d_2"}], "name": "model_1", "output_layers": [["conv1d_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.1", "backend": "tensorflow"}