{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv1d_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 240, 73], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 256, "kernel_regularizer": null, "kernel_size": [25], "activation": "relu", "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D"}, {"config": {"pool_size": [2], "padding": "same", "name": "max_pooling1d_1", "trainable": true, "strides": [2]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D"}, {"config": {"dtype": "float32", "rate": 0.25, "noise_shape": null, "batch_input_shape": [null, 120, 256], "name": "dropout_1", "seed": null, "trainable": true}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"name": "up_sampling1d_1", "trainable": true, "size": 2}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "up_sampling1d_1", "class_name": "UpSampling1D"}, {"config": {"dtype": "float32", "rate": 0.25, "noise_shape": null, "batch_input_shape": [null, 240, 256], "name": "dropout_2", "seed": null, "trainable": true}, "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "strides": [1], "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 73, "kernel_regularizer": null, "kernel_size": [25], "activation": "relu", "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D"}]}, "keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Model"}