{"keras_version": "2.1.1", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dropout_1", 0, 0]], "layers": [{"config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 240, 7], "sparse": false}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 240, 7], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "same", "activation": "relu", "name": "conv1d_1", "kernel_size": [45]}, "name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "same", "activation": "relu", "name": "conv1d_2", "kernel_size": [25]}, "name": "conv1d_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "padding": "same", "activation": "relu", "name": "conv1d_3", "kernel_size": [15]}, "name": "conv1d_3", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "padding": "same", "trainable": true}, "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "MaxPooling1D"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2}, "name": "dropout_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "class_name": "Dropout"}]}, "backend": "tensorflow", "class_name": "Model"}