{"keras_version": "2.1.1", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["conv1d_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 240, 3], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_1", "dilation_rate": [1], "bias_regularizer": null, "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "strides": [1], "kernel_size": [65], "activation": "relu", "padding": "same", "trainable": true, "use_bias": true}, "class_name": "Conv1D"}, {"name": "conv1d_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_2", "dilation_rate": [1], "bias_regularizer": null, "activity_regularizer": null, "filters": 5, "kernel_constraint": null, "strides": [1], "kernel_size": [45], "activation": "linear", "padding": "same", "trainable": true, "use_bias": true}, "class_name": "Conv1D"}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}